Скінчилось кохання, скінчилося все,
Заглядає сонце у вікна осель
Там люди щасливі та сумно мені,
Мабуть утоплюся, спочину на дні
Піду втоплюся у річці глибокій,
Шукати стануть – не скоро знайдуть
Ти будеш плакать – спливатимуть роки,
Мене до смерті не зможеш забуть
Піду втоплюся у річці глибокій,
Шукати стануть – не скоро знайдуть
Ти будеш плакать – спливатимуть роки,
Мене до смерті не зможеш забуть
Життя, як той камінь, на груди лягло
Зроблю, що надумав Марічці на зло
Прощай, мамо люба, і тато, прощай,
Учителька, друзі, прощай, милий край!
Піду втоплюся у річці глибокій,
Шукати стануть – не скоро знайдуть
Ти будеш плакать – спливатимуть роки,
Мене до смерті не зможеш забуть
Піду втоплюся у річці глибокій,
Шукати стануть – не скоро знайдуть
Ти будеш плакать – спливатимуть роки,
Мене до смерті не зможеш забуть
А річка страшною, мов відьма, була
Відходи заводу у море несла
Я річку шукати чистеньку піду –
Шукатиму доти, поки не знайду
Піду втоплюся у річці глибокій,
Шукати стануть – не скоро знайдуть
Ти будеш плакать – спливатимуть роки,
Мене до смерті не зможеш забуть
Піду втоплюся у річці глибокій,
Шукати стануть – не скоро знайдуть
Ти будеш плакать – спливатимуть роки,
Мене до смерті не зможеш забуть
